# St7SetLTASolutionType

Sets the solution type option for linear transient dynamic analysis.

long St7SetLTASolutionType(long uID, long SolutionType)
Input Parameters
uID
Strand7 model file ID.
SolutionType
Solution type; either stFullSystem or stSuperposition.